{
  "2025": {
    "January": {
      "name": "Science Fiction Favorites",
      "image": "theme1",
      "bookList": [
        {
          "title": "Dune",
          "author": "Frank Herbert",
          "publisher": "Ace Books",
          "ISBN": "9780441013593",
          "PublicationDate": "1965-08-01",
          "description": "A science fiction epic set on the desert planet Arrakis, where noble houses fight for control of the valuable spice melange.",
          "image": "img1",
          "qrcode": "QR_code",
          "author_description": "Frank Herbert was an American science fiction writer best known for his Dune series, blending ecological, political, and philosophical themes.",
          "source": "internet"
        },
        {
          "title": "Neuromancer",
          "author": "William Gibson",
          "publisher": "Ace Books",
          "ISBN": "9780441569595",
          "PublicationDate": "1984-07-01",
          "description": "A cyberpunk novel following a washed-up hacker hired for a mysterious job in a dystopian future.",
          "image": "img2",
          "qrcode": "QR_code",
          "author_description": "William Gibson is a Canadian-American author credited with pioneering the cyberpunk genre, exploring technology and its societal impacts."
        }
      ]
    },
    "February": {
      "name": "Classic Literature",
      "image": "theme2",
      "bookList": [
        {
          "title": "Pride and Prejudice",
          "author": "Jane Austen",
          "publisher": "Penguin Classics",
          "ISBN": "9780141439518",
          "PublicationDate": "1813-01-28",
          "description": "A romantic novel exploring love, class, and social expectations in 19th-century England.",
          "image": "img3",
          "qrcode": "QR_code",
          "author_description": "Jane Austen was an Englishnglish novelist known for her witty social commentary and enduring romantic novels set in Regency-era England. Jane Austen was an English novelist known for her witty social commentary and enduring romantic novels set in Regency-era England. Jane Austen was an English novelist known for her witty social commentary and enduring romantic novels set in Regency-era England. Jane Austen was an English novelist known for her witty social commentary and enduring romantic novels set in Regency-era England."
        },
        {
          "title": "1984",
          "author": "George Orwell",
          "publisher": "Signet Classics",
          "ISBN": "9780451524935",
          "PublicationDate": "1949-06-08",
          "description": "A dystopian novel about totalitarianism, surveillance, and the loss of personal freedom.",
          "image": "img4",
          "qrcode": "QR_code",
          "author_description": "George Orwell was an English writer and journalist, renowned for his sharp critiques of totalitarianism and social injustice."
        }
      ]
    }
  },
  "2024": {
    "December": {
      "name": "Mystery Thrillers",
      "image": "theme3",
      "bookList": [
        {
          "title": "The Girl with the Dragon Tattoo",
          "author": "Stieg Larsson",
          "publisher": "Vintage Crime",
          "ISBN": "9780307454546",
          "PublicationDate": "2008-09-16",
          "description": "A gripping mystery involving a hacker and a journalist investigating a decades-old disappearance.",
          "image": "img5",
          "qrcode": "QR_code",
          "author_description": "Stieg Larsson was a Swedish journalist and author, famous for his posthumously published Millennium series of crime novels."
        },
        {
          "title": "Gone Girl",
          "author": "Gillian Flynn",
          "publisher": "Crown Publishing",
          "ISBN": "9780307588371",
          "PublicationDate": "2012-06-05",
          "description": "A psychological thriller about a missing woman and the secrets in her marriage.",
          "image": "img6",
          "qrcode": "QR_code",
          "author_description": "Gillian Flynn is an American author and former television critic, known for her psychologically intense thrillers."
        }
      ]
    }
  }
}